---
kind: method
id: M:Autodesk.Revit.DB.ForgeTypeId.Equals(System.Object)
source: html/89ffea83-f105-0468-af9b-eb00d5de1b97.htm
---
# Autodesk.Revit.DB.ForgeTypeId.Equals Method

Determines whether this ForgeTypeId is equal to another.

## Syntax (C#)
```csharp
public override bool Equals(
	Object other
)
```

## Parameters
- **other** (`System.Object`) - The ForgeTypeId with which to compare this ForgeTypeId.

## Returns
True if the given ForgeTypeId is equal to this one, or false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was NULL